In [ ]:
import pandas as pd

s = pd.Series(data=[1,2,3,4],index=["행1","행2","행3","행4"])
s.loc["행2":"행4":2]

# df = s.loc["행2":"행4"].drop("행3")
# del df["행3"]

행2    2
행4    4
dtype: int64

In [51]:
arr = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
]
idx = ["행1", "행2", "행3"]
col = ["열1","열2","열3"]
df1 = pd.DataFrame(arr,idx,col)
df1

    열1  열2  열3
행1   1   2   3
행2   4   5   6
행3   7   8   9

In [27]:
df2 = pd.DataFrame(arr[1:],idx[1:],col)
df2

    열1  열2  열3
행2   4   5   6
행3   7   8   9

In [28]:
df1+df2

      열1    열2    열3
행1   NaN   NaN   NaN
행2   8.0  10.0  12.0
행3  14.0  16.0  18.0

In [40]:
s = pd.Series(arr[:1],idx[:1])
s

행1    [1, 2, 3]
dtype: object

In [31]:
df1 + s

     열1   열2   열3   행1
행1  NaN  NaN  NaN  NaN
행2  NaN  NaN  NaN  NaN
행3  NaN  NaN  NaN  NaN

In [32]:
df3 = pd.DataFrame(arr[:1],idx[:1],col)

In [36]:
df1+df3

     열1   열2   열3
행1  2.0  4.0  6.0
행2  NaN  NaN  NaN
행3  NaN  NaN  NaN

In [41]:
s1 = pd.Series(arr, idx)
s1 + s

행1    [1, 2, 3, 1, 2, 3]
행2                   NaN
행3                   NaN
dtype: object

In [74]:
arr = [
    [1,2,3],
    [4,5,6],
    [7,8,9]
]

'''
want_del = int(input())

for i in arr:
    del i[want_del]
'''
'''
del arr[0][2], arr[1][2], arr[2][2]

arr'''

for list in arr:
    list.pop(1)

idx = ["행1", "행2", "행3"]
col = ["열1","열2","열3"]
col.pop(1)
df4 = pd.DataFrame(arr, idx, col)
df4

    열1  열3
행1   1   3
행2   4   6
행3   7   9

In [75]:
df1 + df4

    열1  열2  열3
행1   2 NaN   6
행2   8 NaN  12
행3  14 NaN  18

In [77]:
import numpy as np

a = np.random.randint(0,10,24).reshape(4,6)
l1 = ['가','나','다','라']
l2 = ['A','B','C','D','E','F']
df = pd.DataFrame(a,l1,l2)
df

   A  B  C  D  E  F
가  8  9  8  0  0  3
나  4  3  6  0  7  5
다  3  3  3  1  2  3
라  9  7  4  1  1  7

In [ ]:
b = df[['A','B','C']]
b+df

   A  B  C
가  8  9  8
나  4  3  6
다  3  3  3
라  9  7  4
   A  B  C  D  E  F
가  8  9  8  0  0  3
나  4  3  6  0  7  5
다  3  3  3  1  2  3
라  9  7  4  1  1  7

    A   B   C   D   E   F
가  16  18  16 NaN NaN NaN
나   8   6  12 NaN NaN NaN
다   6   6   6 NaN NaN NaN
라  18  14   8 NaN NaN NaN

In [ ]:
c = df[['B','C']]['나':'다'] # 앞은 필터고 뒤는 슬라이싱이므로 형이 다름
d = df.loc['나':'다','B':'C']
print(c)
print(d)

   B  C
나  3  6
다  3  3
   B  C
나  3  6
다  3  3

In [ ]:
e = df.iloc[:, 1:3].drop("B", axis=1) # 축이 1이면 열을 대상으로 삭제함
e

   C
가  8
나  6
다  3
라  4

In [100]:
import pandas as pd

a1 = [60, 84, 80, 70, 19]
a2 = [77, 62, 95, 85, 17]
a3 = [61, 97, 72, 67, 15]
a4 = [75, 65, 95, 51, 18]
cols = ["국어", "영어", "수학", "과학", "나이"]
idx = ["A", "B", "C", "D"]
df = pd.DataFrame([a1, a2, a3, a4], index=idx, columns=cols)
df

   국어  영어  수학  과학  나이
A  60  84  80  70  19
B  77  62  95  85  17
C  61  97  72  67  15
D  75  65  95  51  18

In [107]:
df.sort_values(["영어","수학"], ascending=[1,0])

   국어  영어  수학  과학  나이
B  77  62  95  85  17
D  75  65  95  51  18
A  60  84  80  70  19
C  61  97  72  67  15

In [131]:
# Q1. 위 성적표에서 수학 점수가 동률인 것만 출력

f = df['수학'].sort_values(ascending=False)
cnt = f.value_counts()
idxs = cnt[cnt>1].index

vs = idxs[0]

f[f == vs]

# f.sort_values(ascending=False).iloc[0:2]

B    95
D    95
Name: 수학, dtype: int64

In [135]:
df1

    열1  열2  열3
행1   1   2   3
행2   4   5   6
행3   7   8   9

In [ ]:
df1.add(2)

    열1  열2  열3
행1   3   4   5
행2   6   7   8
행3   9  10  11

In [158]:
df1.loc["행4"] = ['10','11','12']
df1


df1.drop("행4", axis=0, inplace=True)
df1

   열1 열2 열3
행1  1  2  3
행2  4  5  6
행3  7  8  9